# A Term `Mature`
Here, the term 'Mature' means... getting up from the discussed basics

In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

#

# → *Ranking* in Pandas

In [3]:
# Creating a Series
ser = Series(np.arange(45, 55))
ser

0    45
1    46
2    47
3    48
4    49
5    50
6    51
7    52
8    53
9    54
dtype: int32

In [5]:
# Simple rank = Without Tie and Samller number -- lower rank
ser.rank()

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

In [6]:
# Reverse Rank = Without Tie and small number -- high rank
ser.rank(ascending = False)

0    10.0
1     9.0
2     8.0
3     7.0
4     6.0
5     5.0
6     4.0
7     3.0
8     2.0
9     1.0
dtype: float64

In [7]:
# Tie in rank -- Won't discuss reverse here as is simple
ser[1] = ser[0]
ser[5] = ser[4]
ser

0    45
1    45
2    47
3    48
4    49
5    49
6    51
7    52
8    53
9    54
dtype: int32

In [9]:
ser.rank()

0     1.5
1     1.5
2     3.0
3     4.0
4     5.5
5     5.5
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

Now, ↑ this will take the `mean` by default. You can change the other methods as well... Discussed in the book.

In [25]:
ser.rank(method= 'dense')

0    1.0
1    1.0
2    2.0
3    3.0
4    4.0
5    4.0
6    5.0
7    6.0
8    7.0
9    8.0
dtype: float64

###### The same will work with the DF.

##

### → `Corr` and `Corrwith`

    • `corr` is used for Series and DF
    • `corrwith` is used with DF and series as series don't need `corrwith`
    
    Just see...

In [37]:
# Sries
s1 = Series([1,2,3,4,5,6])
s2 = Series([55,33,66,88,99,88])

s1.corr(s2)

0.828416869579514

In [39]:
# DF
df = DataFrame({"S1": s1, "S2": s2})
df

   S1  S2
0   1  55
1   2  33
2   3  66
3   4  88
4   5  99
5   6  88

In [40]:
df.corr()

          S1        S2
S1  1.000000  0.828417
S2  0.828417  1.000000

In [46]:
# When you want to use a series to get corr with df...
df.corrwith(s1)

S1    1.000000
S2    0.828417
dtype: float64

#### Seimlpe!

#

## Getting *more control* over Index matches!
This is `THE PROBLEM` that I was facing and I asked the freaking teacher about the same, and thought there no other option.

**The Problem:** When given a DF and if want to join with another DF, that time if you want to check whether both DF's indices match or not... 

`Option 1:`
* Use **set** operation on index...
    - |, &, ^, ... difference, union, isin, intersection (Pg. 136 Pandas Book)

`Option 2:`
* Use...
    - Index.get_indexer(anotherIndex)

In [50]:
index1 = pd.Index([1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010])
index2 = pd.Index([1001, 1005, 1010, 1015, 1020])

In [51]:
index1

Int64Index([1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010], dtype='int64')

In [52]:
index2

Int64Index([1001, 1005, 1010, 1015, 1020], dtype='int64')

In [57]:
# Option 1
index1 & index2

Int64Index([1001, 1005, 1010], dtype='int64')

In [68]:
# Option 2
index1.get_indexer(index2)

array([ 0,  4,  9, -1, -1], dtype=int64)

Not that... but kind of working right?

#

### → value_counts in `Apply`?

In [78]:
df = DataFrame({"COL1": [1,2,3,4,5],
                "COL2": [22,33,66,55,66]})

In [79]:
df

   COL1  COL2
0     1    22
1     2    33
2     3    66
3     4    55
4     5    66

In [80]:
df.apply(pd.value_counts)

    COL1  COL2
1    1.0   NaN
2    1.0   NaN
3    1.0   NaN
4    1.0   NaN
5    1.0   NaN
22   NaN   1.0
33   NaN   1.0
55   NaN   1.0
66   NaN   2.0

#

### → Reading files with Pandas
The more common stuff is skipped as is already written in the Book, you can refer that, here I am going to discuss only a few special cases and uses that I have seen for the first time.

In [23]:
%%writefile File1.txt

    A    B    C
aaa 123 123 123
bbb 123 123 123

Overwriting File1.txt

In [24]:
pd.read_table('./File1.txt')

       A    B    C
0  aaa 123 123 123
1  bbb 123 123 123

Here, the `read_table` tries to find a TAB seperated values, but as it couldn't it just gives two rows and one column

To resolve that, we can use the `Regular Expression` beause here the seperation is not common...
    
    Wai, Wai, Wai... can't we give `sep= '<space>'`?

    Answer: NO, because the data is evenly spaced, okay... but the headers are not. And as the headers are not seperated by a space, the read_table will try to create new columns based on the space and fill them with nan.

In [19]:
%%writefile File1.txt

    A    B    C
aaa 123 123 123
bbb 123 123 123

Overwriting File1.txt

In [22]:
pd.read_table('./File1.txt', sep= "\s+")

       A    B    C
aaa  123  123  123
bbb  123  123  123

But still error doesn't seem to be solved... (I mean it is solved but) see the aaa, bbb are coming as index by default...

In [26]:
%%writefile File1.txt

        B    C
aaa 123 123 123
bbb 123 123 123

Overwriting File1.txt

In [27]:
pd.read_table('./File1.txt', sep= "\s+")

           B    C
aaa 123  123  123
bbb 123  123  123

Oh... so The empty headered will become an index!

In [28]:
%%writefile File1.txt

INDEX   A       B    C
aaa 123 123 123
bbb 123 123 123

Overwriting File1.txt

In [29]:
pd.read_table('./File1.txt', sep= "\s+")

  INDEX    A    B    C
0   aaa  123  123  123
1   bbb  123  123  123

Now, it worked!  
**But the mystry remains the same: WHAT IS `\s+`?**

#

### → Reading Large files in smaller pieces with `nrows` and `chunksize`

In [31]:
# Making large file (please don't count it into the question)
data = np.random.randint(0, 1000, (10_00_000, 3))
alphabet = np.random.randint(65, 85, (10_00_000, 1))

final_data = np.hstack([data, alphabet])

In [34]:
DataFrame(final_data, columns= ['A', 'B', 'C', 'alpha']).to_csv('million_data.csv')

#

In [44]:
# Reading...
pd.read_csv('million_data.csv', converters= {'alpha':lambda num: chr(int(num))})

        Unnamed: 0    A    B    C alpha
0                0  930  957  699     R
1                1  761  234  280     R
2                2   66  729  499     K
3                3  604  132  329     B
4                4  486  578  617     I
...            ...  ...  ...  ...   ...
999995      999995  346  617  832     M
999996      999996  835  461   25     I
999997      999997  355  776  884     C
999998      999998  624  436   50     S
999999      999999  329  894  263     J

[1000000 rows x 5 columns]

It loaded and worked... but still just to showcase how things would work... let me give this as an example... and also **NOTE that:** this is just a file of size 22MB. **There can be** files of GBs. So, you will need to know how to read in chunk.

And, in the example above, I am using the `converter` argument, which uses some function to convert that perticular column values into some other.

In [48]:
# Now, let's `check` them!
chunks_1000 = pd.read_csv('million_data.csv', converters= {'alpha':lambda num: chr(int(num))}, chunksize= 1000)
chunks_1000

See ↑ it gives an iterator kind of object back. That means, we have (10,00,000 / 1000) = 1000 DataFrames in it ready to be analysed.

In [57]:
next(chunks_1000)

      Unnamed: 0    A    B    C alpha
8000        8000  207  938  667     N
8001        8001  717  108  710     H
8002        8002  299  653  812     O
8003        8003  223  960  303     P
8004        8004  551  736  867     C
...          ...  ...  ...  ...   ...
8995        8995  304  733  774     B
8996        8996  594  137  100     R
8997        8997  709  973  310     A
8998        8998  529  406  365     F
8999        8999   41  379  377     T

[1000 rows x 5 columns]

The ↑ example is after I hit 5-6 times... so this can be the 5th or 6th DF.
###### Reassigning...

In [107]:
chunks_1000 = pd.read_csv('million_data.csv', converters= {'alpha':lambda num: chr(int(num))}, chunksize= 1000)
chunks_1000

Now, actually I wanted to count the FREQUENCY that how many times a key - `alpha` apears in the WHOLE dataset. If I would go for whole dataset, and process million rows together... it would take much resources. 

So I decided to go with chunks... Again, this is very small dataset by size. There can be dataset of GBs, that can't be fit directly into the memory...

In [112]:
counter = Series([], dtype= np.int32)

In [109]:
counter

Series([], dtype: int32)

In [110]:
for df in chunks_1000:
    # Series
    frequencies = df['alpha'].value_counts() 
    
    # Series + Series (why? See below)
    counter = counter.add(frequencies, fill_value = 0)

In [111]:
counter

A    49992.0
B    50193.0
C    49674.0
D    50048.0
E    50130.0
F    49921.0
G    50057.0
H    50037.0
I    50162.0
J    50247.0
K    50039.0
L    50128.0
M    49845.0
N    49920.0
O    49801.0
P    50169.0
Q    50291.0
R    49675.0
S    49978.0
T    49693.0
dtype: float64

WoW! We have just worked with series and kept count with the different chunks.  
__  
**Why? Part**:  
Now, as I have used...
```python
counter.add(freq, fill_value= 0)
```
instead of...
```python
counter + freq
```

The reason is that... as our usual *Data Alignment* part,
> When you add/subtract or do any other operation between two series, **there will be a unioun of series index** and the operation will be done ONLY on the indices which match the series. 

So, when there is an *empty* series, and for the first time when you do  
*`EITHER of these`*
```python
counter.add(freq, fill_value= 0)
#or
counter + freq
```
will create a series full of NaN because for the first time, it was not having any index and new index came, so made it NaN and then for the second time, EVEN if the indices are matching, it will add values `WITH NAN` and result in `NAN` ... just to resolve that `WE WILL USE - .add(fill_calue = 0)`.

Simple.

#

## Somewhere above...
I stored a CSV file containing a million rows... that has cost the memory and time... 

There are many ways to store a DF in a real way... 
* to_pickle()
* to_hdf()

These are the binary file formats. That might also help you to compress the size! You may want to use them.
___
**The exciting one** is the HDF5.
    
<p> 
    It is well-regarded file format intended for storing *`large`* quantities of scientific array data. It is available as C library and it has interfaces available in many languages including python.
</p>
<p> 
    HDF: <i>Hierarchical Data Format</i>
</p>
<p>
    <b>The main thing:</b> HDF5 can support storing multiple datasets i.e. DFs. Compared to simpler formats - HDF5 supports "<b>on-the-fly</b>" compression with a variety of compression modes, enebling data with repeated patterns to be stored more effectively. HDF5 can be a good choice working with very large datasets that don't fit in the memory.
</p>

**The thing** to keep in mind is that HDF5 is not a database. It is best suited for write once and read many task. As data can be added after storing it once, if multiple writers write in it together, the file can be corrupted.

In [2]:
# A small example would make more sense!
big_data_1_million = np.random.randint(0, 1000, (10_00_000, 4))
df = DataFrame(big_data_1_million)
df

          0    1    2    3
0       837  248  402  108
1       387  147  159  911
2       493   72   61  842
3       393  641  889  710
4       152  677    9   80
...     ...  ...  ...  ...
999995  538  277  772  379
999996  626  480   50   46
999997  227  615  205  482
999998  193  675  657  465
999999  261  650  899  696

[1000000 rows x 4 columns]

`Way 1`

In [23]:
file = pd.HDFStore('million_file.h5')

*Currently the file size is 1 KB*.

In [21]:
# As a file, it can be closed too!
file.close()

After closing, you won't be able to write or read from it... and when you open it with the same syntax, it won't overwrite - but will open from the last state. Which is like opening in the append mode.

In [13]:
file = pd.HDFStore('million_file.h5')

In [24]:
file['DF1'] = df

*Now, the size is 23 MB (which is bigger than csv! - WTF?)*

Keeping track: 23,445 KB

In [25]:
# Reading
file['DF1']

          0    1    2    3
0       837  248  402  108
1       387  147  159  911
2       493   72   61  842
3       393  641  889  710
4       152  677    9   80
...     ...  ...  ...  ...
999995  538  277  772  379
999996  626  480   50   46
999997  227  615  205  482
999998  193  675  657  465
999999  261  650  899  696

[1000000 rows x 4 columns]

See? How easy it was than CSV.

In [27]:
# Saving another table
file['DF2'] = df * 2

In [31]:
file['DF2']

           0     1     2     3
0       1674   496   804   216
1        774   294   318  1822
2        986   144   122  1684
3        786  1282  1778  1420
4        304  1354    18   160
...      ...   ...   ...   ...
999995  1076   554  1544   758
999996  1252   960   100    92
999997   454  1230   410   964
999998   386  1350  1314   930
999999   522  1300  1798  1392

[1000000 rows x 4 columns]

So easy!

The default format is `fixed` when you do...
```python
file['DF'] = df # <-- This stores in the `fixed` format
```

But if we need to change the storing type, we need to use `.put()` so that we can pass the parameters as `table` which gives us the **accessibility to use query to access the data**.

In [36]:
# Storing as table
file.put('DF3', df, format= 'table')

In [39]:
file.select('DF3', where= ['index > 100 and index < 105'])

       0    1    2    3
101  822  998  210  668
102  606  444  250  599
103  564  865  696  535
104  201  591  474  685

Cool! isn't it?
(The same `.select(where = [])` would fail if we try to use DF2 (which is not in table format))

#

`Way 2`

In [40]:
df.to_hdf('million_data2.h5', 'DF1', format= 'table')

This gives us the size of 23,886 KB which is bigger than 23,445 KB.

In [42]:
df.to_hdf('million_data2.h5', 'DF1')

Now ↑ is exactly - 23,445 KB (becasue it makes difference with format)

**Enough**! Now we will discuss something else...

#

## → Accessing Excel with Pandas
I know, these topics are not much providing... but I am exploring the new things! You can skip these cells.
___
Again, 2 ways for excel with pandas.

    Wai, Wai, Wai... there is one more thing to tell... basically pandas uses:
    • xlrd
    • openpyxl
    
    Native packages of python to access the excel files. Which becomes the THIRD way. But here
    I will discuss the first two.

`Way 1`

In [50]:
xlsx = pd.ExcelFile('./TempTrial.xlsx')

In [52]:
pd.read_excel(xlsx)

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

`Way 2`

In [53]:
pd.read_excel('./TempTrial.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

Now, you may ask - WTF?  
Okay, okay I get you... wait a moment, let me explain... the **first way** is about loading a file and then reusing it for DIFFERENT SHEETS. The **second way** is for one time read - so when you want to read the DIFFERENT sheet, you will want to read the file again!

It is better to load the file ONCE when there are multiple sheets and the read the perticular sheet when required. So, two ways.
___
The same kind of concept applies for writing excel file in 2 ways...

```python
# Way 1
writer = pd.ExcelWriter(path)
df.to_excel(writer, 'sheet1')

# Way 2
df.to_excel(path)
```

#

# That's it!
(The other ways like from API, and web and sql reading - are normal and RWR. So, I am not covering them here. Please read the book for that Aayush ∞

Really! Now that we have become mature in pandas - we will ge deeper for the **data cleaning and preparation phase** but as usual, I woun't be naming the file names as the chapter names. But will... just you see how I organize things.